---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandlesData.SetStartHandle(System.Int32)
source: html/5ee2af24-0a90-1f21-26e1-dc88993c762f.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlesData.SetStartHandle Method

Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully.

## Syntax (C#)
```csharp
public void SetStartHandle(
	int startHandleTag
)
```

## Parameters
- **startHandleTag** (`System.Int32`) - The tag of the start handle.